Autodesk.Revit.Exceptions.CorruptModelException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.CorruptModelException
The exception that is thrown when the model is or seems corrupt.